InformationRegisters/ТК_СправочникиСкубис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_СправочникиСкубис</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>0 - новый, 1 - модифицирован,  2 - удален, 3 - Выгружен</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТК_СправочникиСкубис</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТК_СправочникиСкубис/Ext/ManagerModule.bsl
Процедура ЗаписатьОбъектСкубис(Ссылка)Экспорт
	
	Набор = РегистрыСведений.ТК_СправочникиСкубис.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(Ссылка);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		НоваяЗапись = Набор.Добавить();
		НоваяЗапись.Объект = Ссылка;
		НоваяЗапись.ИД = Строка(Ссылка.УникальныйИдентификатор());
		НоваяЗапись.Статус = 0;
	Иначе
		НоваяЗапись = Набор[0];
		Если НоваяЗапись.Статус = 0 ИЛИ НоваяЗапись.Статус = 1 Тогда
			Возврат;
		КонецЕсли;
		
		НоваяЗапись.Статус = 1;

	КонецЕсли;
	
	Набор.Записать();

КонецПроцедуры
